ALackOfNumbers/MSP430-BMI160/main.c
#include <msp430.h> 
#include "driverlib.h"
#include "NcApi.h"
#include "NeoParser.h"

//******************************************************************************
// Defines *********************************************************************
//******************************************************************************
#define SLAVE_ADDR 0x69
#define MAX_BUFFER_SIZE 20

//******************************************************************************
// UART Functions **************************************************************
//******************************************************************************
void UART_transmitString( char *pStr )
{
    while( *pStr )
    {
        while(!(UCA0IFG&UCTXIFG));
        UCA0TXBUF = *pStr;
        pStr++;
    }
}
//******************************************************************************
// I2C Functions ***************************************************************
//******************************************************************************
typedef enum I2C_ModeEnum{
    IDLE_MODE,
    NACK_MODE,
    TX_REG_ADDRESS_MODE,
    RX_REG_ADDRESS_MODE,
    TX_DATA_MODE,
    RX_DATA_MODE,
    SWITCH_TO_RX_MODE,
    SWITHC_TO_TX_MODE,
    TIMEOUT_MODE
} I2C_Mode;

/* Used to track the state of the software state machine*/
I2C_Mode MasterMode = IDLE_MODE;

uint8_t TransmitRegAddr = 0;
uint8_t ReceiveBuffer[MAX_BUFFER_SIZE] = {0};
uint8_t RXByteCtr = 0;
uint8_t ReceiveIndex = 0;
uint8_t TransmitBuffer[MAX_BUFFER_SIZE] = {0};
uint8_t TXByteCtr = 0;
uint8_t TransmitIndex = 0;

void CopyArray(uint8_t *source, uint8_t *dest, uint8_t count)
{
    uint8_t copyIndex = 0;
    for (copyIndex = 0; copyIndex < count; copyIndex++)
    {
        dest[copyIndex] = source[copyIndex];
    }
}

I2C_Mode I2C_Master_ReadReg(uint8_t dev_addr, uint8_t reg_addr, uint8_t count)
{
    /* Initialize state machine */
    MasterMode = TX_REG_ADDRESS_MODE;
    TransmitRegAddr = reg_addr;
    RXByteCtr = count;
    TXByteCtr = 0;
    ReceiveIndex = 0;
    TransmitIndex = 0;

    /* Initialize slave address and interrupts */
    UCB1I2CSA = dev_addr;
    UCB1IFG &= ~(UCTXIFG + UCRXIFG);       // Clear any pending interrupts
    UCB1IE &= ~UCRXIE;                       // Disable RX interrupt
    UCB1IE |= UCTXIE;                        // Enable TX interrupt

    UCB1CTLW0 |= UCTR + UCTXSTT;             // I2C TX, start condition
    __bis_SR_register(LPM0_bits + GIE);              // Enter LPM0 w/ interrupts

    return MasterMode;

}


I2C_Mode I2C_Master_WriteReg(uint8_t dev_addr, uint8_t reg_addr, uint8_t *reg_data, uint8_t count)
{
    /* Initialize state machine */
    MasterMode = TX_REG_ADDRESS_MODE;
    TransmitRegAddr = reg_addr;

    //Copy register data to TransmitBuffer
    CopyArray(reg_data, TransmitBuffer, count);

    TXByteCtr = count;
    RXByteCtr = 0;
    ReceiveIndex = 0;
    TransmitIndex = 0;

    /* Initialize slave address and interrupts */
    UCB1I2CSA = dev_addr;
    UCB1IFG &= ~(UCTXIFG + UCRXIFG);       // Clear any pending interrupts
    UCB1IE &= ~UCRXIE;                       // Disable RX interrupt
    UCB1IE |= UCTXIE;                        // Enable TX interrupt

    UCB1CTLW0 |= UCTR + UCTXSTT;             // I2C TX, start condition
    __bis_SR_register(LPM0_bits + GIE);              // Enter LPM0 w/ interrupts

    return MasterMode;
}

//******************************************************************************
// BMI160 Functions ************************************************************
//******************************************************************************
uint16_t bmi160_readX(int PC_Send)
{
    I2C_Master_ReadReg(SLAVE_ADDR, 0x12, 2);
    uint16_t result = (ReceiveBuffer[0] | ReceiveBuffer[1] << 8);
    if(PC_Send == 1)
    {
        while(!(UCA0IFG&UCTXIFG));
        UCA0TXBUF = ReceiveBuffer[0];
        while(!(UCA0IFG&UCTXIFG));
        UCA0TXBUF = ReceiveBuffer[1];
    }
    return result;
}

uint16_t bmi160_readY(int PC_Send)
{
    I2C_Master_ReadReg(SLAVE_ADDR, 0x14, 2);
    uint16_t result = (ReceiveBuffer[0] | ReceiveBuffer[1] << 8);
    if(PC_Send == 1)
    {
        while(!(UCA0IFG&UCTXIFG));
        UCA0TXBUF = ReceiveBuffer[0];
        while(!(UCA0IFG&UCTXIFG));
        UCA0TXBUF = ReceiveBuffer[1];
   }
    return result;
}

uint16_t bmi160_readZ(int PC_Send)
{
    I2C_Master_ReadReg(SLAVE_ADDR, 0x16, 2);
    uint16_t result = (ReceiveBuffer[0] | ReceiveBuffer[1] << 8);
    if(PC_Send == 1)
    {
        while(!(UCA0IFG&UCTXIFG));
        UCA0TXBUF = ReceiveBuffer[0];
        while(!(UCA0IFG&UCTXIFG));
        UCA0TXBUF = ReceiveBuffer[1];
    }
    return result;
}

void bmi160_init(char FOC_axis)
{
    uint8_t writeData[1];
    //Read Chip ID, which is D1
    I2C_Master_ReadReg(SLAVE_ADDR, 0x00, 1);
    if(ReceiveBuffer[0] != 0xD1)
    {
        UART_transmitString(" Incorrect sensor chip ID ");
    }
    //Configure the accelerometer
    writeData[0]=0b00101011; //Set acc_us to 0 for off, and acc_bwp must then be 010. Set acc_odr to 1011 for 800Hz sample rate
    I2C_Master_WriteReg(SLAVE_ADDR, 0x40, writeData, 1);
    //Check if configuration worked
    I2C_Master_ReadReg(SLAVE_ADDR, 0x40, 1);
    if(ReceiveBuffer[0] != 0b00101011)
    {
        UART_transmitString(" Accelerometer config failed ");
    }
    //Set the range of the accelerometer
    writeData[0]=0b1000; //0b0011 for 2g, 0b0101 for 4g, 0b1000 for 8g
    I2C_Master_WriteReg(SLAVE_ADDR, 0x41, writeData, 1);
    //Check if range is set
    I2C_Master_ReadReg(SLAVE_ADDR, 0x41, 1);
    if(ReceiveBuffer[0] != 0b1000)
    {
        UART_transmitString(" Accelerometer range set failed ");
    }

    //Any motion setup

    //Set the successive slope threshold
    writeData[0]=0b00000001; //0b00000001 + 1 so two successive slopes
    I2C_Master_WriteReg(SLAVE_ADDR, 0x5F, writeData, 1);
    //Check if slope threshold is set
    I2C_Master_ReadReg(SLAVE_ADDR, 0x5F, 1);
    if(ReceiveBuffer[0] != 0b00000001)
    {
        UART_transmitString(" Slope threshold not set ");
    }
    //Set trigger level
    writeData[0]=0b00000001; //15.63mg*value for 8g range, so 0b00000001 means 1*15.63mg=15.63mg
    I2C_Master_WriteReg(SLAVE_ADDR, 0x60, writeData, 1);
    //Check trigger is set
    I2C_Master_ReadReg(SLAVE_ADDR, 0x60, 1);
    if(ReceiveBuffer[0] != 0b00000001)
    {
        UART_transmitString(" Trigger not set ");
    }

    //Double tap setup

    //Set single and double tap timings
    writeData[0] = 0b00000110; //Quiet of 30ms, shock of 50ms, double tap within 500ms
    I2C_Master_WriteReg(SLAVE_ADDR, 0x63, writeData, 1);
    //Read the timings
    I2C_Master_ReadReg(SLAVE_ADDR, 0x63, 1);
    if(ReceiveBuffer[0] != 0b00000110)
    {
        UART_transmitString(" Tap timings not set ");
    }
    //Set tap threshold
    writeData[0] = 0b0000; //125mg threshold
    I2C_Master_WriteReg(SLAVE_ADDR, 0x64, writeData, 1);
    //Read the threshold
    I2C_Master_ReadReg(SLAVE_ADDR, 0x64, 1);
    if(ReceiveBuffer[0] != 0b0000)
    {
        UART_transmitString(" Tap timings not set ");
    }

    //Interrupt setup

    //Set pins
    writeData[0] = 0b10001000; //Output, push-pull, active low for int1 and int2
    I2C_Master_WriteReg(SLAVE_ADDR, 0x53, writeData, 1);
    //Read pin status
    I2C_Master_ReadReg(SLAVE_ADDR, 0x53, 1);
    if(ReceiveBuffer[0] != 0b10001000)
    {
        UART_transmitString(" Pins not set ");
    }
    //Set interrupts to temporary instead of latched (permanent till cleared)
    writeData[0] = 0b1101; //Temp for 1.28s
    I2C_Master_WriteReg(SLAVE_ADDR, 0x54, writeData, 1);
    //Check interrupts
    I2C_Master_ReadReg(SLAVE_ADDR, 0x54, 1);
    if(ReceiveBuffer[0] != 0b1101)
    {
        UART_transmitString(" Interrupts not temp ");
    }
    //Map any motion detection to Int1
    writeData[0] = 0b00000100; //Mapped any motion to int1
    I2C_Master_WriteReg(SLAVE_ADDR, 0x55, writeData, 1);
    //Check interrupt
    I2C_Master_ReadReg(SLAVE_ADDR, 0x55, 1);
    if(ReceiveBuffer[0] != 0b00000100)
    {
        UART_transmitString(" Any motion not mapped ");
    }
    //Map double tap to Int2
    writeData[0] = 0b00010000; //Mapped double tap to int2
    I2C_Master_WriteReg(SLAVE_ADDR, 0x57, writeData, 1);
    //Check interrupt
    I2C_Master_ReadReg(SLAVE_ADDR, 0x57, 1);
    if(ReceiveBuffer[0] != 0b00010000)
    {
        UART_transmitString(" Double tap not mapped ");
    }
    //Set tap data filtering
    writeData[0] = 0b1000; //Filtered data instead of pre-filtered
    I2C_Master_WriteReg(SLAVE_ADDR, 0x58, writeData, 1);
    //Check filtering
    I2C_Master_ReadReg(SLAVE_ADDR, 0x58, 1);
    if(ReceiveBuffer[0] != 0b1000)
    {
        UART_transmitString(" Filter not set ");
    }
    //Set the Accelerometer to normal power mode
    writeData[0] = 0x11;
    I2C_Master_WriteReg(SLAVE_ADDR, 0x7E, writeData, 1);
    //Read power mode status of sensors
    I2C_Master_ReadReg(SLAVE_ADDR, 0x03, 1);
    if(ReceiveBuffer[0] != 0x10)
    {
    UART_transmitString(" Accelerometer not on ");
    }

