ALackOfNumbers/MSP430-BMI160/main.c
    //Fast Offset Compensation (FOC) setup
    //0 for reserved, 0 for gyroscope, 00 for x, 00 for y, 0 for z (10 = -1g, 00 = 0g, 01 = 1g)
    switch(FOC_axis)
    {
        case 'X':
            writeData[0] = 0b00100000;
            break;
        case 'Y':
            writeData[0] = 0b00001000;
            break;
        case 'Z':
            writeData[0] = 0b00000010;
            break;
        default:
            writeData[0] = 0b00000000; //Default of all 0g
            break;
    }
    I2C_Master_WriteReg(SLAVE_ADDR, 0x69, writeData, 1);
    //Check FOC
    I2C_Master_ReadReg(SLAVE_ADDR, 0x69, 1);
    if(ReceiveBuffer[0] != writeData[0])
    {
        UART_transmitString(" FOC not set ");
    }
    //Start FOC
    writeData[0] = 0x03;
    I2C_Master_WriteReg(SLAVE_ADDR, 0x7E, writeData, 1);
    //Wait until FOC is finished
    int finish = 0;
    while(finish==0)
    {
        I2C_Master_ReadReg(SLAVE_ADDR, 0x1B, 1);
        if((ReceiveBuffer[0] & 0b00001000) == 0b00001000)
        {
            finish = 1;
        }
    }
    //Enable offset compensation
    writeData[0] = 0b01000000; //Enable accelerometer offset compensation
    I2C_Master_WriteReg(SLAVE_ADDR, 0x77, writeData, 1);
    //Check offset compensation
    I2C_Master_ReadReg(SLAVE_ADDR, 0x77, 1);
    if(ReceiveBuffer[0] != 0b01000000)
    {
        UART_transmitString(" Offset not enabled ");
    }
    //UART_transmitString(" BMI160 Initialized ");
}

//******************************************************************************
// NeoCortec Functions *********************************************************
//******************************************************************************

//Not sure what the purpose of this is
typedef union
{
tNcApiHostAckNack       NcApiAckNack;
tNcApiHostData          NcApiHostData;
tNcApiHostDataHapa      NcApiHostDataHapa;
tNcApiHostUappData      NcApiHostDataUapp;
tNcApiHostUappDataHapa  NcApiHostDataUappHapa;
tNcApiWesStatus         NcApiWesStatus;
tNcApiNodeInfoReply     NcApiNodeInfo;
tNcApiNeighborListReply NcApiNeighborList;
tNcApiNetCmdReply       NcApiNetCmdResponse;
tNcApiWesSetupRequest   NcApiWesSetupRequest;
}tNcApiAllMessages;

tNcApi g_ncApi[1];
uint8_t g_numberOfNcApis = 1;

NcApiErrorCodes NcApiSupportTxData(uint8_t n, uint8_t * finalMsg, uint8_t finalMsgLength)
{
    int i;
    for(i = 0; i < finalMsgLength; i++)
    {
        while(!(UCA1IFG&UCTXIFG));
        UCA1TXBUF = finalMsg[i];
    }
    return NCAPI_OK;
}

void NcApiSupportMessageWritten(uint8_t n, void * callbackToken, uint8_t * finalMsg, uint8_t finalMsgLength)
{
    int i;
    for(i = 0; i < finalMsgLength; i++)
    {
        switch(i)
        {
            case 0:
                UART_transmitString(" CMD: "); //Command
                break;
            case 2:
                UART_transmitString(" PL: "); //Payload Length
                break;
            case 3:
                UART_transmitString(" RCVR: "); //Receiver Node
                break;
            case 4:
                UART_transmitString(" DTA: "); //Payload Data
                break;
            default:
                break;
        }
        while(!(UCA0IFG&UCTXIFG));
        UCA0TXBUF = finalMsg[i];
    }
}

void NcApiSupportMessageReceived(uint8_t n,void * callbackToken, uint8_t * msg, uint8_t msgLength)
{
    tNcApiAllMessages NcApiMsg;

    switch(msg[0])
    {
    case HostAckEnum:
        NcApiGetMsgAsHostAck(msg, &NcApiMsg.NcApiAckNack);
        break;
    case HostNAckEnum:
        NcApiGetMsgAsHostAck(msg, &NcApiMsg.NcApiAckNack);
        break;
    case HostDataEnum:
        NcApiGetMsgAsHostData(msg, &NcApiMsg.NcApiHostData);
        break;
    case HostDataHapaEnum:
        NcApiGetMsgAsHostDataHapa(msg, &NcApiMsg.NcApiHostDataHapa);
        break;
    case HostUappDataEnum:
        NcApiGetMsgAsHostUappData(msg, &NcApiMsg.NcApiHostDataUapp);
        break;
    case HostUappDataHapaEnum:
        NcApiGetMsgAsHostUappDataHapa(msg, &NcApiMsg.NcApiHostDataUappHapa);
        break;
    case NodeInfoReplyEnum:
        NcApiGetMsgAsNodeInfoReply(msg, &NcApiMsg.NcApiNodeInfo);
        break;
    case NeighborListReplyEnum:
        NcApiGetMsgAsNeighborListReply(msg, &NcApiMsg.NcApiNeighborList);
        break;
    case NetCmdReplyEnum:
        NcApiGetMsgAsNetCmdResponse(msg, &NcApiMsg.NcApiNetCmdResponse);
        break;
    case WesStatusEnum:
        NcApiGetMsgAsWesStatus(msg, &NcApiMsg.NcApiWesStatus);
        break;
    case WesSetupRequestEnum:
        NcApiGetMsgAsWesSetupRequest(msg, &NcApiMsg.NcApiWesSetupRequest);
        break;
    default:
        // unhandled
        break;
    }

}

void ExampleSendUnacknowledged(uint16_t destNodeId, uint8_t port, uint16_t appSeqNo, uint8_t * payload, uint8_t payloadLen)
{
    tNcApiSendUnackParams args;
    NcApiErrorCodes apiStatus;
    args.msg.destNodeId = destNodeId;
    args.msg.destPort = port;
    args.msg.appSeqNo = appSeqNo;
    args.msg.payload = payload;
    args.msg.payloadLength = payloadLen;
    args.callbackToken = &g_ncApi;
    apiStatus = NcApiSendUnacknowledged(0, &args);
    if (apiStatus != NCAPI_OK)
    {
        ; // Application specific
    }
}

void ExampleSendAcknowledged(uint16_t destNodeId, uint8_t port, uint8_t * payload, uint8_t payloadLen)
{
    tNcApiSendAckParams args;
    NcApiErrorCodes apiStatus;
    args.msg.destNodeId = destNodeId;
    args.msg.destPort = port;
    args.msg.payload = payload;
    args.msg.payloadLength = payloadLen;
    args.callbackToken = &g_ncApi;
    apiStatus = NcApiSendAcknowledged(0, &args);
    if (apiStatus != NCAPI_OK)
    {
        ; // Application specific
    }
}
//******************************************************************************
// Device Initialization *******************************************************
//******************************************************************************
void initGPIO()
{
    /* Terminate all GPIO pins to Output LOW to minimize power consumption */
    GPIO_setAsOutputPin(GPIO_PORT_PA, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PB, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PC, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PD, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PE, GPIO_PIN_ALL16);
    GPIO_setAsOutputPin(GPIO_PORT_PF, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PA, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PB, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PC, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PD, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PE, GPIO_PIN_ALL16);
    GPIO_setOutputLowOnPin(GPIO_PORT_PF, GPIO_PIN_ALL16);

    // Configure P3.4 and P3.5 to UART (Primary, TX and RX respectively)
    P3SEL0 |= BIT4 | BIT5;                    // USCI_A1 UART operation
    P3SEL1 &= ~(BIT4 | BIT5);                 // SEL1 is 0 and SEL0 is 1 for primary operation, inverse for secondary

