ALackOfNumbers/MSP430-BMI160/main.c
//I2C Interrupt
#pragma vector = USCI_B1_VECTOR
__interrupt void USCI_B1_ISR(void)
{
  //Must read from UCB1RXBUF
  uint8_t rx_val = 0;
  switch(__even_in_range(UCB1IV, USCI_I2C_UCBIT9IFG))
  {
    case USCI_NONE:          break;         // Vector 0: No interrupts
    case USCI_I2C_UCALIFG:   break;         // Vector 2: ALIFG
    case USCI_I2C_UCNACKIFG:                // Vector 4: NACKIFG
      UCB1CTLW0 |= UCTXSTT;                 // Re-send start if NACK
      break;
    case USCI_I2C_UCSTTIFG:  break;         // Vector 6: STTIFG
    case USCI_I2C_UCSTPIFG:  break;         // Vector 8: STPIFG
    case USCI_I2C_UCRXIFG3:  break;         // Vector 10: RXIFG3
    case USCI_I2C_UCTXIFG3:  break;         // Vector 12: TXIFG3
    case USCI_I2C_UCRXIFG2:  break;         // Vector 14: RXIFG2
    case USCI_I2C_UCTXIFG2:  break;         // Vector 16: TXIFG2
    case USCI_I2C_UCRXIFG1:  break;         // Vector 18: RXIFG1
    case USCI_I2C_UCTXIFG1:  break;         // Vector 20: TXIFG1
    case USCI_I2C_UCRXIFG0:                 // Vector 22: RXIFG0
        rx_val = UCB1RXBUF;
        if (RXByteCtr)
        {
          ReceiveBuffer[ReceiveIndex++] = rx_val;
          RXByteCtr--;
        }

        if (RXByteCtr == 1)
        {
          UCB1CTLW0 |= UCTXSTP;
        }
        else if (RXByteCtr == 0)
        {
          UCB1IE &= ~UCRXIE;
          MasterMode = IDLE_MODE;
          __bic_SR_register_on_exit(CPUOFF);      // Exit LPM0
        }
        break;
    case USCI_I2C_UCTXIFG0:                 // Vector 24: TXIFG0
        switch (MasterMode)
        {
          case TX_REG_ADDRESS_MODE:
              UCB1TXBUF = TransmitRegAddr;
              if (RXByteCtr)
                  MasterMode = SWITCH_TO_RX_MODE;   // Need to start receiving now
              else
                  MasterMode = TX_DATA_MODE;        // Continue to transmision with the data in Transmit Buffer
              break;

          case SWITCH_TO_RX_MODE:
              UCB1IE |= UCRXIE;              // Enable RX interrupt
              UCB1IE &= ~UCTXIE;             // Disable TX interrupt
              UCB1CTLW0 &= ~UCTR;            // Switch to receiver
              MasterMode = RX_DATA_MODE;    // State state is to receive data
              UCB1CTLW0 |= UCTXSTT;          // Send repeated start
              if (RXByteCtr == 1)
              {
                  //Must send stop since this is the N-1 byte
                  while((UCB1CTLW0 & UCTXSTT));
                  UCB1CTLW0 |= UCTXSTP;      // Send stop condition
              }
              break;

          case TX_DATA_MODE:
              if (TXByteCtr)
              {
                  UCB1TXBUF = TransmitBuffer[TransmitIndex++];
                  TXByteCtr--;
              }
              else
              {
                  //Done with transmission
                  UCB1CTLW0 |= UCTXSTP;     // Send stop condition
                  MasterMode = IDLE_MODE;
                  UCB1IE &= ~UCTXIE;                       // disable TX interrupt
                  __bic_SR_register_on_exit(CPUOFF);      // Exit LPM0
              }
              break;

          default:
              __no_operation();
              break;
        }
        break;
    default: break;
  }
}

#pragma vector = PORT1_VECTOR
__interrupt void PORT1_ISR(void)
{
    switch(__even_in_range(P1IV, P1IV_P1IFG7))
       {
           case P1IV_NONE : break;
           case P1IV_P1IFG0 : break;
           case P1IV_P1IFG1 :    // Button S1 pressed
               GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0); //Toggle LED1
               GPIO_clearInterrupt(GPIO_PORT_P1, GPIO_PIN1);
               break;
           case P1IV_P1IFG2 :   // Button S2 pressed
               __delay_cycles(32000000);
               GPIO_clearInterrupt(GPIO_PORT_P1, GPIO_PIN2); //4 second pause
               break;
           case P1IV_P1IFG3 :   // CTS high to low transition on P1.3
               NcApiCtsActive(0);
               break;
           case P1IV_P1IFG4 : //
               NcApiCallbackNwuActive(0);
               break;
           case P1IV_P1IFG5 : break;
           case P1IV_P1IFG6 : break;
           case P1IV_P1IFG7 : break;
           default : _never_executed();
       }
}

#pragma vector = PORT2_VECTOR
__interrupt void PORT2_ISR(void)
{
    switch(__even_in_range(P2IV, P2IV_P2IFG7))
       {
           case P2IV_NONE : break;
           case P2IV_P2IFG0 : break;
           case P2IV_P2IFG1 : break;
           case P2IV_P2IFG2 : break;
           case P2IV_P2IFG3 : break;
           case P2IV_P2IFG4 : break;
           case P2IV_P2IFG5 :
               UART_transmitString(" Double tap ");
               break;
           case P2IV_P2IFG6 : break;
           case P2IV_P2IFG7 : break;
           default : _never_executed();
       }
}

#pragma vector = PORT3_VECTOR
__interrupt void PORT3_ISR(void)
{
    switch(__even_in_range(P3IV, P3IV_P3IFG7))
       {
           case P3IV_NONE : break;
           case P3IV_P3IFG0 : break;
           case P3IV_P3IFG1 : break;
           case P3IV_P3IFG2 :
               UART_transmitString(" Any motion ");
               break;
           case P3IV_P3IFG3 : break;
           case P3IV_P3IFG4 : break;
           case P3IV_P3IFG5 : break;
           case P3IV_P3IFG6 : break;
           case P3IV_P3IFG7 : break;
           default : _never_executed();
       }
}

#pragma vector=USCI_A1_VECTOR
__interrupt void USCI_A1_ISR(void)
{
  switch(__even_in_range(UCA1IV, USCI_UART_UCTXCPTIFG))
  {
    case USCI_NONE: break;
    case USCI_UART_UCRXIFG:
        NcApiRxData(0, UCA1RXBUF);
        break;
    case USCI_UART_UCTXIFG: break;
    case USCI_UART_UCSTTIFG: break;
    case USCI_UART_UCTXCPTIFG: break;
  }
}

#pragma vector=USCI_A0_VECTOR
__interrupt void USCI_A0_ISR(void)
{
  switch(__even_in_range(UCA0IV, USCI_UART_UCTXCPTIFG))
  {
    case USCI_NONE: break;
    case USCI_UART_UCRXIFG:break;
    case USCI_UART_UCTXIFG: break;
    case USCI_UART_UCSTTIFG: break;
    case USCI_UART_UCTXCPTIFG: break;
  }
}
